package com.yang.user.mynewsdemo.ui.bean;

import java.util.List;

/**
 * Created by User on 2017/3/31.
 */

public class VtexJokeBean {

    /**
     * code : 200
     * msg : success
     * newslist : [{"id":35386,"title":"幸运","content":"某商店有强盗光顾，第二天，店主对来查案的探员说：\u201c感谢上帝，幸好强盗不是前天晚上而是昨晚来的。\u201d<br/>\u201c这有什么不同？\u201d探员问。<br/>\u201c昨天早上，我把全部商品降价40％，要是前天晚上来，我的损失可大了。\u201d "},{"id":35386,"title":"出门留言","content":"一天，科利特太太外出有事，她锁上门，然后用大头针将一张留给送奶工的便条钉在门上；\u201c没有人在家，不要留任何东西！\u201d当她晚上回家时，发现门已打开，家中被抢劫一空，在她留下的便条上，多了这样一段话：\u201c谢谢你，我们没有留下多少东西！\u201d"},{"id":35386,"title":"多此一问","content":"一位年轻牧师刚到职，便去拜访一位分娩不久的母亲。<br/>他问道：\u201c孩子好漂亮。他有多大了？\u201d<br/>\u201c今天满两个月。\u201d<br/>\u201c好极了，他弟弟呢？\u201d <br/>"},{"id":35386,"title":"连服三天","content":"巴德尔看完病，医生递给他一张开好药的处方：<br/>\u201c请把这个处方收好。每天早上服一次，连服三天。\u201d<br/>巴德尔回到家里，把处方仔细地裁为三张。<br/>每天早上他都按时吃一张。 <br/>"},{"id":35386,"title":"梦吃","content":"<br/>某女士：我丈夫对我爱得发狂。他在睡梦中说了许多非常甜蜜的话。不过有件可笑的事\u2014\u2014他总叫错我的名字。 "},{"id":35386,"title":"把狗叫进来","content":"书房里，吉米在做作业，他爸爸在画画。两人都非常专注。<br/>吉米正抄到有关大雨的几个形容词，忽然想起妈妈吩咐过，下雨时要把晒在院子里的被子收回来。于是，他问父亲：\u201c爸爸，外面有没有下雨？\u201d<br/>爸爸说：\u201c我不知道。但有个办法很简便：把狗叫进来，看它身上湿不湿就知道了。\u201d"},{"id":35386,"title":"暗号","content":"据你的生辰八字推算你今天将发一笔横财,为了安全,请将发型整理成爆炸式,穿补丁衣裤,右手拿一木棍左手持一个瓷碗沿街点头而行,接头暗号:行行好!!!!! <br/>"},{"id":35386,"title":"寻人","content":"有一日李先生个子唔见佐，距同距老婆都好惊，就去佐报案，个POLICE就问距老公叫咩名，距话：\u201c李广鲜。\u201d跟住个POLICE就问距老婆叫咩名，距话：\u201c吴广住。\u201d甘个POLICE就话：\u201c你地来做乜？\u201d距地话：\u201c揾李笨。\u201d个POLICE好嬲话：\u201c你地都混吉噶````````\u201d <br/>"},{"id":35386,"title":"鳄鱼皮鞋","content":"有两个傻哥俩，有一日忽然想显阔，于是去向智者打听\u201c什么皮鞋最好？\u201d，答曰:\"鳄鱼皮鞋\u201c。两兄弟就来到鳄鱼经常出没的河边，开始捕捉鳄鱼。当他们捕到第十条时，弟弟忍不住了：\u201d哥，是不是有人走漏了风声，不然这两天我们捉到的鳄鱼怎么没有一条是穿着皮鞋的？\u201d"},{"id":35386,"title":"近亲不能结婚","content":"计划生育下乡，问一农民。你知道为什么近亲不能结婚吗？老农想了一下道：~~~~呵呵`~~~~大家都是亲戚，不好下手~~~ <br/>"},{"id":35386,"title":"用脑！！！！！！","content":"一位父亲想考一考他的儿子，就问：\u201c一个加五个，等于几个？\u201d儿子扳着手指头算了一会儿，说：\u201c六个。\u201d\u201c七个加十五个等于个呢？\u201d儿子又扳着手指算，手指数不够，加上脚趾头，还不够。怎么办呢？父亲生气地说：\u201c你不会用脑子吗？\u201d儿子说：\u201c脑子只有一个，加上去还是不够用啊！\u201d"},{"id":35386,"title":"选国王","content":"海底王国选国王，必须100斤，乌龟想参加竞选，但它只有99斤，它便找蜗牛帮忙，蜗牛说：\u201c帮你可以，但等你当上国王后，必须让我当宰相。\u201d乌龟答应了。 <br/>选举时，蜗牛被发现了，\u201c你干什么呢！？\u201d蜗牛忙狡辩：\u201c别误会，我给乌龟讲故事呢！\u201d <br/>"},{"id":35386,"title":"手机短信","content":" 你孤独吗？ <br/> 你寂寞吗？ <br/> 你觉得全世界都不了解你吗？ <br/> 没关系，就算是全世界都不要你我这里的大门也会向你 <br/>敞开，这里是国营养猪厂。 <br/>"},{"id":35386,"title":"他二姨","content":"经常听同事讲另一女同事\u201c他二姨，他二姨....\u201d,以为他们是亲戚, 后来才知他讲的是\"猪八戒他二姨...\" <br/>"},{"id":35386,"title":"好运","content":"丈夫十分高兴的向妻子说道：\u201c好运气！我问售货员买一把锁要多少钱，他说一元。我付钱后打开一看，里面还有两把钥匙。他忘了收我的钥匙钱了。\u201d \u201c小声些，别让人听见了。\u201d妻子连忙提醒道。\u201d"},{"id":35386,"title":"火车能直起行走?","content":"有一天,一位老太爷带着孙子到处玩,不知不觉就到了铁轨旁边,正好一辆火车来了(他不知道这就是火车),火车去后他就想,这个车爬着跑都跑的这么快,如果立起来了跑,那不就更快吗?他想了一阵,觉的他这个建议很好,就边笑边走回家了!!!!!!! <br/>"},{"id":35386,"title":"侧面进攻不好使","content":"一哥眼睛先天性斜视，平时好习武，常对人吹嘘自己武艺高强。有人问：就你这眼睛还能有什么好的武艺？哥答曰：别看我的眼睛斜，可谁要对我侧面进攻是绝对不好使的 <br/>"},{"id":35386,"title":"日历","content":"有一老农进城，进入一公厕，与公厕管理员闲聊，问曰：\u201c生意如何？\u201d答曰：\u201c还可以。\u201d老农比较实在的说：\u201c象你这样，随便弄一点就够吃了。\u201d管理员不解其意，生气的说：\u201c唉，他妈的乡下人真坏，只放屁，不拉屎。\u201d "},{"id":35386,"title":"小姑娘上茅房","content":"小小姑娘清早起床~提起裤子上茅房~茅房有人敲不开门~就快拉出来~小小姑娘抬头张望~四处无人！就蹲在大路旁~刚刚蹲下对面来人~是位老大妈~大妈笑着向她走过来~ 跟着递过来一张纸~小小姑娘脸红忙说不要了~谁知仔细一看罚款单100元！！！ <br/>"},{"id":35386,"title":"关系","content":"一女子去部队探亲，在填写登记表时，有一栏为\u201c关系\u201d。她心想：\u201c部队怎么连这种问题都问？\u201d没办法，她只好填上\u201c一周三次\u201d。值勤战士接过登记表，看了看说：\u201c填表有误，请重新填写!\u201d女子很惊奇，心里咕哝道：\u201c他怎么会知道？\u201d随后，不得不按事实填上：\u201c一周七次\u201d。 <br/>"}]
     */

    private int code;
    private String msg;
    private List<NewslistBean> newslist;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public List<NewslistBean> getNewslist() {
        return newslist;
    }

    public void setNewslist(List<NewslistBean> newslist) {
        this.newslist = newslist;
    }

    public static class NewslistBean {
        /**
         * id : 35386
         * title : 幸运
         * content : 某商店有强盗光顾，第二天，店主对来查案的探员说：“感谢上帝，幸好强盗不是前天晚上而是昨晚来的。”<br/>“这有什么不同？”探员问。<br/>“昨天早上，我把全部商品降价40％，要是前天晚上来，我的损失可大了。”
         */

        private int id;
        private String title;
        private String content;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }
    }
}
